# MoveNext Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTableIterator..::..MoveNext Method
ExportLinetypeTableIterator Class See Also
---
Increments the iterator to the next item.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Return Value
True if the iteration has no more items. False if there are more items to be iterated.
# See Also
ExportLinetypeTableIterator Class
Autodesk.Revit.DB Namespace